title: Google Cloud Service Account Key Created
id: 321dd572-8fca-4279-b38d-42e27c52d32b
status: test
description: Detects when a Service Account key is created in Google Cloud.
references:
  - https://cloud.google.com/iam/docs/keys-create-delete
author: Murtaza Udaipurwala
date: 2025-06-09
modified: 2025-06-09
tags:
  - attack.impact
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.protoPayload.methodName: google.iam.admin.v1.CreateServiceAccountKey
  condition: selection
level: medium
