title: Google Cloud Pub/Sub Subscription Deleted
id: 4277ed72-0ba8-4019-8b06-7b8bf866fdb2
status: test
description: Detects when a Pub/Sub subscription is deleted in Google Cloud.
references:
  - https://cloud.google.com/pubsub/docs/audit-logging
author: Pratheep
date: 2025-06-10
tags:
  - attack.impact
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.protoPayload.methodName: google.pubsub.v1.Subscriber.DeleteSubscription
  condition: selection
level: medium
