title: Google Cloud Pub/Sub Topic Created
id: ccc82224-d9af-4bf7-aaee-5e36e27f20f4
status: test
description: Detects when a new Pub/Sub topic is created in Google Cloud.
references:
  - https://cloud.google.com/pubsub/docs/audit-logging
author: Pratheep
date: 2025-06-10
tags:
  - attack.impact
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.protoPayload.methodName: google.pubsub.v1.Publisher.CreateTopic
  condition: selection
level: medium
