title: Google Cloud Logging Bucket Created
id: d0cafbac-f599-417e-b491-dd733e515de8
status: test
description: Detects when a logging bucket is created in Google Cloud.
references:
  - https://cloud.google.com/logging/docs/buckets
author: Murtaza Udaipurwala
date: 2025-06-09
modified: 2025-06-09
tags:
  - attack.impact
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.protoPayload.methodName:
      - google.logging.v2.ConfigServiceV2.CreateBucket
      - google.logging.v2.ConfigServiceV2.UndeleteBucket
  condition: selection
level: medium
