title: Google Cloud Service Account Key Deleted
id: 70c3d7ac-de84-4777-9c48-11d72d52d9a7
status: test
description: Detects when a Service Account key is deleted in Google Cloud.
references:
  - https://cloud.google.com/iam/docs/keys-create-delete
author: Murtaza Udaipurwala
date: 2025-06-09
modified: 2025-06-09
tags:
  - attack.impact
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.protoPayload.methodName: google.iam.admin.v1.DeleteServiceAccountKey
  condition: selection
level: medium
