title: Google Cloud Logging Sink Deleted
id: bcb954f7-12f9-4a40-aeb0-a12b09804680
status: test
description: Detects when a Cloud Logging sink is deleted in Google Cloud.
references:
  - https://cloud.google.com/logging/docs/export/configure_export_v2
  - https://cloud.google.com/logging/docs/audit-logging
author: Pratheep
date: 2025-06-10
tags:
  - attack.impact
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.protoPayload.methodName: google.logging.v2.ConfigServiceV2.DeleteSink
  condition: selection
level: medium